"""
실시간 검색어 크롤링

실시간 검색어 순위를 text파일로 불러온다.
BeautifulSoup을 사용

크롤링이란?
- crawling
    - 크롤러 crawler
        - 기는 것, 파충류
        - 웹사이트를 기어다니면서 데이터를 모으는 것
        - 웹페이지의 데이터를 모아주는 소프트웨어
    - 크롤러를 사용해 웹페이지의 데이터를 추출해 내는 행위
    - python의 크롤러를 사용하기

함수와 모듈

함수
- 조립하는 기계
- 자주 사용되는 코드들을 묶어서 사용
- 반복적인 작업을 줄여준다.
- 조립기계 (갈색블록, 초록색블록)

construct_machine(brown block, green block):
    나무 만들기

모듈
- 함수(클래스와 변수도 포함)들을 모아놓은 파일
- 조립기계를 묶어놓은 키트
- 집, 공장, 차도 만들고 싶을 때
- 50 30 100개씩 만들고 싶다.
- 각각의 조립 기계를 사용
- 세가지 기계를 묶어서 -> 마을 조립 키트

외부 모듈 설치하기
- requests
    - conda install requests
- BeautifulSoup
    -
"""