"""
WEB
    - World Wide Web
    - 정보의 그물망
    - 하이퍼링크
        - 원하는 정보 위치로 정보전달
        - 비순차적
    - URL
        - 정보자원이 어디에 있는지 알려주는 표식
        - 정보의 위치정보
    - HTTP
        - 정보로 접근하고 통신하게 해주는 약속
        - URL과 통신하기 위해
            - 요청
                - get
                    - 갖다 줘
                    - html을 받아온다.
                - post
                    - 처리해 줘
                    - 댓글을 달았다면
                        - 댓글을 등록해달라는 요청
        - 프로토콜 (통신방법)
    - HTML
        - 응답으로서의 정보 자원 자체
        - a 태그를 통해 다른 자원과 연결할 수 있다.

SERVER
    - url, html을 미리 가지고 있고
    - 요청에 응답하는 컴퓨터
    - www.google.com url에 대한 html을 준비하고있고
    - 요청이 들어오면 html을 나의 웹브라우저로 보여준다.

web brower
    - http 요청을 보내주고
    - 받은 html을 보기 좋게 보여주는 도구

WEB service
    - 사용자가 원할만한 정보와 위치를 html과 url로 준비
    - 요청에 대한 응답을 보낼 수 있는 프로그램
"""